[
  {
    "title": "Software Engineer",
    "company_name": "Citadel",
    "location": "United States",
    "via": "Citadel",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=RWEdoNhlI17bJoBFAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7BeJ0owgmIrjoKCK4FueSpGeSEu9C7sCu_rl1eePrvqtu2_NLP64h3ChmQmywhwd7EHQtJGCCO3MsuLkk1Spna0WKiaJOczCB35YJPc92Yi9_BklLV4tTHI6nw2wqxd36mtWNWCATPCkrjtAvA8oPEbhKRoQAAAA&shmds=v1_AdeF8KgmEkKsIVaPnrxuZFK6gs3HSqGeswWeOaU0kUg3LL0k_Q&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=RWEdoNhlI17bJoBFAAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/68432db0a7d78447a6fabcd0/images/8232322e9c3cbd9e6f444f069b93e2ca660136c2f32b02428a53cb635d511b5e.png",
    "extensions": [
      "2 days ago",
      "Full-time",
      "Health insurance",
      "Dental insurance"
    ],
    "detected_extensions": {
      "posted_at": "2 days ago",
      "schedule_type": "Full-time",
      "health_insurance": true,
      "dental_coverage": true
    },
    "description": "At Citadel, Software Engineers are responsible for building the systems that power every aspect of our investment process, from research and analysis to trading, risk management, funding and settlement. Working side by side with investors and quantitative researchers, we use our technical skills to drive critical commercial outcomes. If you’re interested in financial markets and excited by the prospect of having real impact in a fast-paced environment where everyone is inspired to be their best, we’re excited to meet you.\n\nOur most successful engineers are critical thinkers who know how to dissect the problem as proficiently as they know how to build the solution. While we look for technical acumen, commercial acumen is just as important. That includes the ability to flex, change course, and iterate without always having pre-defined specs.\n\nYOUR OPPORTUNITY:\nFrom system engineers who create next-gen platforms to desk-aligned developers who partner with investment teams to increase efficiency and maximize returns, our engineering opportunities are as varied as they are challenging. If you are selected for an interview, one of our recruiters will be in touch to review the specific roles, teams and regions that best align with your skills, seniority, and experience.\n\nYOUR SKILLS & TALENTS:\n• 6+ years of professional software engineering experience\n• Solid computer science fundamentals\n• Expert level programing skills in at least one of the following: Java, C++, Python\n• Proven track record in software design and development\n• Excellent analysis / problem solving skills\n• Strong communication and teamwork skills\n• Ability to manage multiple tasks in a demanding and dynamic environment\n• Minimum of a Bachelor’s degree in Computer Science or a related STEM discipline\n\nIn accordance with applicable law, the base salary range for this role is $150,000 to $300,000.\nIn addition, the employee who fills this role will be eligible to participate in a discretionary incentive compensation program,\nas well as a wide array of benefit programs, such as medical and life insurance, retirement and tax-free savings plans,\nand access to other healthcare programs.",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "That includes the ability to flex, change course, and iterate without always having pre-defined specs",
          "6+ years of professional software engineering experience",
          "Solid computer science fundamentals",
          "Expert level programing skills in at least one of the following: Java, C++, Python",
          "Proven track record in software design and development",
          "Excellent analysis / problem solving skills",
          "Strong communication and teamwork skills",
          "Ability to manage multiple tasks in a demanding and dynamic environment",
          "Minimum of a Bachelor’s degree in Computer Science or a related STEM discipline"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "In accordance with applicable law, the base salary range for this role is $150,000 to $300,000",
          "In addition, the employee who fills this role will be eligible to participate in a discretionary incentive compensation program,",
          "as well as a wide array of benefit programs, such as medical and life insurance, retirement and tax-free savings plans,",
          "and access to other healthcare programs"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "Citadel",
        "link": "https://www.citadel.com/careers/details/software-engineer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "QSC",
        "link": "https://careers.qsc.com/us/en/job/4746/Software-Engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Workday",
        "link": "https://mckesson.wd3.myworkdayjobs.com/en-US/External_Careers/job/Software-Engineer_JR0128038?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Humanforce",
        "link": "https://www.livehire.com/careers/livemarket/job/RKYCM/PL1NL19IDM/software-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Jobvite",
        "link": "https://jobs.jobvite.com/cmgfi/job/o0BXvfwN?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Freshpaint",
        "link": "https://www.freshpaint.io/about?ashby_jid=bfe56523-bff4-4ca3-936b-0ba15fb4e572&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Selby Jennings",
        "link": "https://www.selbyjennings.com/en-ae/job/software-engineer-pr547206_1748535997?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Careers At Moody's",
        "link": "https://careers.moodys.com/software-engineer/job/29134523?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkNpdGFkZWwiLCJhZGRyZXNzX2NpdHkiOiJVbml0ZWQgU3RhdGVzIiwiaHRpZG9jaWQiOiJSV0Vkb05obEkxN2JKb0JGQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyJ9"
  },
  {
    "title": "Software Engineer V (Multiple Openings)",
    "company_name": "SPECTRUM",
    "location": "Greenwood Village, CO",
    "via": "Spectrum Careers",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=krJOG3ETAmA93fRNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXNwQqCQBCAYbr6CJ2mW0VpBF0KuogEgRhZXmW1ad3YZpadDX2cHjW7_Mfvj76T6FjyM_TKI2SkDSF6qGCef2wwziIUDsmQlgWs4cwNCCrfdsAEJ2ZtcXroQnCyTxIRG2sJKpg2bvmdMGHDQ_LiRv6ppRsnzqqA9Xa3GWJHejkrL1l6u95zMCPoEalnfkBlrFUaV5AWPwInOACjAAAA&shmds=v1_AdeF8KiAXGMiTg62EWQ1Tsln9-AOGPUmDM6GSbq0YlXMPuwhBg&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=krJOG3ETAmA93fRNAAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/68432db0a7d78447a6fabcd0/images/8232322e9c3cbd9ee58de994288504c435bd211f24faba238c793d9c224d569e.png",
    "extensions": [
      "4 days ago",
      "117,021–156,600 a year",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "4 days ago",
      "salary": "117,021–156,600 a year",
      "schedule_type": "Full-time"
    },
    "description": "TITLE: Software Engineer V (Multiple Openings)\nLOCATION: Greenwood Village, CO\n\nJOB SUMMARY: Design, develop, modify, test, and document software systems to support new and existing business initiatives for Charter’s cDVR (Cloud Digital Video Recording) and IP client messaging service functionality of the Spectrum TV application. Integrate Charter’s internal video applications with Spectrum TV and Spectrum Guide to ensure seamless operation and enhanced customer experience. Write RESTful services in Java, Spring, Node.js, using databases such as MongoDB and frameworks around Java and J2EE. Apply CI/CD (Continuous Integration/Continuous Delivery) techniques to automate the software delivery process. Use industry-standard tools, including Argo and GitLab, to build, test, and deploy code. Configure, install, and monitor development and test infrastructure on AWS, ensuring efficient resource usage and cost control, including setting up databases, caching servers, and other critical components. Use Docker for containerization and Kubernetes EKS for container orchestration to manage deployment and scaling of applications. Conduct performance testing to identify bottlenecks and ensure optimal application performance. Collaborate with development and test teams to execute tests. Actively participate in Agile and Scrum processes, including daily stand-ups, sprint planning, and retrospectives. Triage and resolve critical production issues, manage hotfixes, and ensure minimal downtime. Create and maintain detailed technical documentation, including requirements, design specifications, and deployment guides\n\nEDUCATION/REQUIREMENTS: Bachelor's degree in Computer Science, Computer Engineering, or related field. 3 years of experience in the following: performing software development to write and maintain software applications or Unix scripts for automating system changes and application deployments; utilizing containerized applications with Docker and managing their deployment and scaling with Kubernetes; utilizing Cloud technologies to configure, install and monitor cloud infrastructure; and with Git and CI/CD automation. 1 year of experience conducting application and performance tests to identify and resolve bottlenecks and defects. A hybrid (in office and remote work) arrangement is available.\n\nSalaries depend on geography, experience, and education; negotiations begin at $117,021 per year.\n\nESW344 2025-55671 2025\n\nHere, employees don’t just have jobs, they build careers. That’s why we believe in offering a comprehensive pay and benefits package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant’s criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2025-07-14 09:00 PM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between $117,021.00 and $156,600.00. The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nGet to Know Us Charter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet®, TV, Mobile and Voice, Spectrum Networks, Spectrum Business and Spectrum Reach. When you join us, you’re joining a strong community of 95,000 employees working together to serve more than 31 million customers in 41 states and keep them connected to what matters most. Watch this video to learn more.\nWho You Are Matters Here We’re committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets. Learn about our inclusive culture.",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "EDUCATION/REQUIREMENTS: Bachelor's degree in Computer Science, Computer Engineering, or related field",
          "3 years of experience in the following: performing software development to write and maintain software applications or Unix scripts for automating system changes and application deployments; utilizing containerized applications with Docker and managing their deployment and scaling with Kubernetes; utilizing Cloud technologies to configure, install and monitor cloud infrastructure; and with Git and CI/CD automation",
          "1 year of experience conducting application and performance tests to identify and resolve bottlenecks and defects"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "Salaries depend on geography, experience, and education; negotiations begin at $117,021 per year",
          "That’s why we believe in offering a comprehensive pay and benefits package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life",
          "The base pay for this position generally is between $117,021.00 and $156,600.00",
          "The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location",
          "We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "JOB SUMMARY: Design, develop, modify, test, and document software systems to support new and existing business initiatives for Charter’s cDVR (Cloud Digital Video Recording) and IP client messaging service functionality of the Spectrum TV application",
          "Integrate Charter’s internal video applications with Spectrum TV and Spectrum Guide to ensure seamless operation and enhanced customer experience",
          "Write RESTful services in Java, Spring, Node.js, using databases such as MongoDB and frameworks around Java and J2EE",
          "Apply CI/CD (Continuous Integration/Continuous Delivery) techniques to automate the software delivery process",
          "Use industry-standard tools, including Argo and GitLab, to build, test, and deploy code",
          "Configure, install, and monitor development and test infrastructure on AWS, ensuring efficient resource usage and cost control, including setting up databases, caching servers, and other critical components",
          "Use Docker for containerization and Kubernetes EKS for container orchestration to manage deployment and scaling of applications",
          "Conduct performance testing to identify bottlenecks and ensure optimal application performance",
          "Collaborate with development and test teams to execute tests",
          "Actively participate in Agile and Scrum processes, including daily stand-ups, sprint planning, and retrospectives",
          "Triage and resolve critical production issues, manage hotfixes, and ensure minimal downtime",
          "Create and maintain detailed technical documentation, including requirements, design specifications, and deployment guides",
          "This job posting will remain open until 2025-07-14 09:00 PM (UTC) and will be extended if necessary"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "Spectrum Careers",
        "link": "https://jobs.spectrum.com/job/greenwood-village/software-engineer-v-multiple-openings/4673/82110983808?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "LinkedIn",
        "link": "https://www.linkedin.com/jobs/view/software-engineer-v-multiple-openings-at-spectrum-4244810684?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Indeed",
        "link": "https://www.indeed.com/viewjob?jk=1bd6abc525ae1cb1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Built In Colorado",
        "link": "https://www.builtincolorado.com/job/software-engineer-v-multiple-openings/6369890?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Experteer",
        "link": "https://us.experteer.com/career/view-jobs/software-engineer-v-multiple-openings-greenwood-village-co-usa-51907111?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Built In",
        "link": "https://builtin.com/job/software-engineer-v-multiple-openings/6369890?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "The Muse",
        "link": "https://www.themuse.com/jobs/spectrum/software-engineer-v-multiple-openings?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Monster",
        "link": "https://www.monster.com/job-openings/software-engineer-v-multiple-openings-greenwood-village-co--4b0969c9-1aee-4310-835f-9ee4d6a6b60f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBWIChNdWx0aXBsZSBPcGVuaW5ncykiLCJjb21wYW55X25hbWUiOiJTUEVDVFJVTSIsImFkZHJlc3NfY2l0eSI6IkdyZWVud29vZCBWaWxsYWdlLCBDTyIsImh0aWRvY2lkIjoia3JKT0czRVRBbUE5M2ZSTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3cifQ=="
  },
  {
    "title": "Software Engineer",
    "company_name": "Serco North America",
    "location": "Loveland, CO (+3 others)",
    "via": "Serco Inc. - ICIMS",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=R5B_oq7dkC9vWl-AAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU4HLiLaiOCik4gIIjr0A0oar0kkvQu5Q_sRfrS6vPFVn0k1b7jXty0IJ_KREAus4MIdCNriAjDBmdknnO6DapadMSKp9qJWo6sdD4YJOx7Nkzv500r4dTlZxXazXY91Jr-YNVgcw42LBjgMWKKzEAmu_MJk6bGE4_0Lj5INRY8AAAA&shmds=v1_AdeF8Kg8dLWQu7JPHPmjC9DM6Nj0f8YJydAcxfooLgcL41eliQ&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=R5B_oq7dkC9vWl-AAAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/68432db0a7d78447a6fabcd0/images/8232322e9c3cbd9e97cb57e90de3e3db7da0e56887e8f2e6888b4328b5089edc.jpeg",
    "extensions": [
      "14 hours ago",
      "Full-time"
    ],
    "detected_extensions": {
      "posted_at": "14 hours ago",
      "schedule_type": "Full-time"
    },
    "description": "Position Description\n\nAre you a Software Engineer looking for an opportunity to make an impact every day? Serco is the place for you! Discover this exciting opportunity in Colorado Springs! Our Software Engineer (Journeyman) will provide software support for the sustainment and modernization of the US Space Force Satellite Control Network (SCN). The SCN provides highly reliable telemetry, tracking, command, communication and control (TT&C3) for more than 170 Department of Defense (DoD), National Reconnaissance Office (NRO), civil and allied satellites.\n\nThe SCN consists various satellite tracking stations across the globe and operational support nodes at Schriever Space Force Base (SFB) and Vandenberg SFB. Our Software Engineer will perform software sustainment engineering on the various mission and non-mission systems using Agile Software Development.\n\nIn this role, you will:\n• Perform software studies to find replacements for existing mission software\n• Perform trade studies and proof of concept development and testing\n• Develop new software release processes\n• Review, analyze, and modify programming systems including encoding, testing, debugging and installing to support application systems\n• Consult with users to identify current operating procedures and to clarify program objectives\n• Coordinate closely with team members, Product Owners and Scrum Masters to ensure User Story alignment and implementation to customer use cases.\n• Analyze (through demonstrations, proof of concept, performance, and end-to-end testing) and effectively coordinate Infrastructure needs driven by developed software to meet customer mission needs\n• Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n• Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.\n• Prepare and install solutions by determining and designing system specifications, standards, and programming.\n• Improve operations by conducting systems analysis; recommending changes in policies and procedures.\n• Develop software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas.\n• Supporting testing, writing and executing automated test scripts and unit tests\n• Coordinate closely with team members, Product Owners and Scrum Masters to ensure User Story alignment and implementation to customer use cases.\n• Analyze (through demonstrations, proof of concept, performance, and end-to-end testing) and effectively coordinate Infrastructure needs driven by developed software to meet customer mission needs.\n• Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions.\n• Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code.\n• Prepare and install solutions by determining and designing system specifications, standards, and programming.Improve operations by conducting systems analysis; recommending changes in policies and procedures.\n• Develop software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas.\n• Support testing, writing and executing automated test scripts and unit tests.\n\nMeet your Recruiter!\n\nhttps://serco.kzoplatform.com/player/medium/2797363347937301809\n\nQualifications\n\nTo be successful in this role, you will have:\n• The ability to obtain an active secret security clearance.\n• US Citizenship\n• A Bachelor of Science or Bachelor of Arts and 3 years of related experience\n• Experience in software development using Java, C and or C++\n• Experience in at least one of the following:\n• Linux, Unix, Pearl/Python\n• Testing/Scripting experience\n• The ability to travel on occasion up to 25%.\n\nAdditional desired experience and skills:\n• An active Secret clearance or higher\n• Experience writing and executing test scripts\n• Experience on DoD programs and interaction with government stakeholders - SCN experience is a plus.\n• Experience using the following COTS tools: VersionOne, GitHub, SharePoint, Fortify\n• Writing custom simulations\n• Agile Software Development experience\n• Agile certifications (software development oriented)\n\nApply today to discover your place in our world!\n\nIn compliance with state and local laws regarding pay transparency, the salary range for this role is $85,032.41 to $141,720.69; however, Serco considers several factors when extending an offer, including but not limited to, the role and associated responsibilities, a candidate's work experience, education/training, and key skills.\n\nCompany Overview\n\nSerco Inc. (Serco) is the Americas division of Serco Group, plc. In North America, Serco’s 9,000+ employees strive to make an impact every day across 100+ sites in the areas of Defense, Citizen Services, and Transportation. We help our clients deliver vital services more efficiently while increasing the satisfaction of their end customers. Serco serves every branch of the U.S. military, numerous U.S. Federal civilian agencies, the Intelligence Community, the Canadian government, state, provincial and local governments, and commercial clients. While your place may look a little different depending on your role, we know you will find yours here. Wherever you work and whatever you do, we invite you to discover your place in our world. Serco is a place you can count on and where you can make an impact because every contribution matters.\n\nTo review Serco benefits please visit: https://www.serco.com/na/careers/benefits-of-choosing-serco. If you require an accommodation with the application process please email: careers@serco-na.com or call the HR Service Desk at 800-628-6458, option 1. Please note, due to EEOC/OFCCP compliance, Serco is unable to accept resumes by email.\n\nCandidates may be asked to present proof of identify during the selection process. If requested, this will require presentation of a government-issued I.D. (with photo) with name and address that match the information entered on the application. Serco will not take possession of or retain/store the information provided as proof of identity. For more information on how Serco uses your information, please see our Applicant Privacy Policy and Notice.\n\nSerco does not accept unsolicited resumes through or from search firms or staffing agencies without being a contracted approved vendor. All unsolicited resumes will be considered the property of Serco and will not be obligated to pay a placement or contract fee. If you are interested in becoming an approved vendor at Serco, please email Agencies@serco-na.com.\n\nSerco is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics.",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "The ability to obtain an active secret security clearance",
          "US Citizenship",
          "A Bachelor of Science or Bachelor of Arts and 3 years of related experience",
          "Experience in software development using Java, C and or C++",
          "Experience in at least one of the following:",
          "Linux, Unix, Pearl/Python",
          "Testing/Scripting experience",
          "The ability to travel on occasion up to 25%",
          "If requested, this will require presentation of a government-issued I.D. (with photo) with name and address that match the information entered on the application"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "In compliance with state and local laws regarding pay transparency, the salary range for this role is $85,032.41 to $141,720.69; however, Serco considers several factors when extending an offer, including but not limited to, the role and associated responsibilities, a candidate's work experience, education/training, and key skills"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Our Software Engineer (Journeyman) will provide software support for the sustainment and modernization of the US Space Force Satellite Control Network (SCN)",
          "The SCN provides highly reliable telemetry, tracking, command, communication and control (TT&C3) for more than 170 Department of Defense (DoD), National Reconnaissance Office (NRO), civil and allied satellites",
          "The SCN consists various satellite tracking stations across the globe and operational support nodes at Schriever Space Force Base (SFB) and Vandenberg SFB",
          "Our Software Engineer will perform software sustainment engineering on the various mission and non-mission systems using Agile Software Development",
          "Perform software studies to find replacements for existing mission software",
          "Perform trade studies and proof of concept development and testing",
          "Develop new software release processes",
          "Review, analyze, and modify programming systems including encoding, testing, debugging and installing to support application systems",
          "Consult with users to identify current operating procedures and to clarify program objectives",
          "Coordinate closely with team members, Product Owners and Scrum Masters to ensure User Story alignment and implementation to customer use cases",
          "Analyze (through demonstrations, proof of concept, performance, and end-to-end testing) and effectively coordinate Infrastructure needs driven by developed software to meet customer mission needs",
          "Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions",
          "Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code",
          "Prepare and install solutions by determining and designing system specifications, standards, and programming",
          "Improve operations by conducting systems analysis; recommending changes in policies and procedures",
          "Develop software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas",
          "Supporting testing, writing and executing automated test scripts and unit tests",
          "Coordinate closely with team members, Product Owners and Scrum Masters to ensure User Story alignment and implementation to customer use cases",
          "Analyze (through demonstrations, proof of concept, performance, and end-to-end testing) and effectively coordinate Infrastructure needs driven by developed software to meet customer mission needs",
          "Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions",
          "Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code",
          "Prepare and install solutions by determining and designing system specifications, standards, and programming",
          "Improve operations by conducting systems analysis; recommending changes in policies and procedures",
          "Develop software solutions by studying information needs; conferring with users; studying systems flow, data usage, and work processes; investigating problem areas",
          "Support testing, writing and executing automated test scripts and unit tests"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "Serco Inc. - ICIMS",
        "link": "https://careers-sercous.icims.com/jobs/69785/software-engineer/job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Teal",
        "link": "https://www.tealhq.com/job/software-engineer_3fa4748f-fce8-4f9f-87cc-dbac09c99113?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Ladders",
        "link": "https://www.theladders.com/job/software-engineer-serco-loveland-co_81581715?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Jobrapido.com",
        "link": "https://us.jobrapido.com/jobpreview/73901625361563648?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Jobilize",
        "link": "https://www.jobilize.com/job/us-co-loveland-software-engineer-serco-north-america-hiring-now-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IlNlcmNvIE5vcnRoIEFtZXJpY2EiLCJhZGRyZXNzX2NpdHkiOiJMb3ZlbGFuZCwgQ08iLCJodGlkb2NpZCI6IlI1Ql9vcTdka0M5dldsLUFBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3In0="
  },
  {
    "title": "Staff Software Engineer - Java",
    "company_name": "Experian",
    "location": "United States",
    "via": "Experian",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=7l8M8ksaEFVadNevAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xWOMQrCQBAAsc0PtNpaMCdCGq2DYBusw-bcu5wku8ftovmFXzZpZrphqt-uajrDEKCTYF8sBC3HxEQFTvDAD26SAZSw-BGE4S4SJzrcRrOsV-dUpzqqoSVfe5mdMA2yuLcMuqHXca3mCY36S3Ne6szxuG-XTCUhQ2J4cjJ6wbphpH8eJkKakgAAAA&shmds=v1_AdeF8Ki2EsILDJHYOiETu3lQXJ4uvBuXXIn_0azrlsL_Lu4FSA&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=7l8M8ksaEFVadNevAAAAAA%3D%3D",
    "extensions": [
      "3 days ago",
      "Full-time",
      "No degree mentioned",
      "Paid time off",
      "Health insurance",
      "Dental insurance"
    ],
    "detected_extensions": {
      "posted_at": "3 days ago",
      "schedule_type": "Full-time",
      "qualifications": "No degree mentioned",
      "paid_time_off": true,
      "health_insurance": true,
      "dental_coverage": true
    },
    "description": "Experian is looking for an experienced Staff Software Engineer (Cloud-native Java) who can excel in developing and delivering direct-to-customer products on a cloud-native Java platform. Reporting to the Senior Manager of Software Engineering, you will lead projects and developers using the latest technologies and are an important player in designing and implementing product features. This is a technical role requiring excellent coding skills.\n\nResponsibilities:\n• Hands-on leader with active contributions as a member of software engineering teams focused on building API-based systems, delivering secure, efficient solutions in a bold timeframe.\n• Develop scalable and reliable systems supporting consumer and data-centric products and services on an AWS cloud-based platform\n• Integrate 3rd Party and Internal API, async, and file-based services using CSV, JSON, or XML data\n• You will oversee deliverables from brainstorming through testing/validation and production operationalization\n• Lead, mentor, and collaborate with other team members\n• Diligently observe and maintain Standards for Regulatory Compliance and Information Security\n• Without fail, deliver and maintain accurate, complete, and current documentation\n\nAbout Experian\n\nExperian is a global data and technology company that powers opportunities for people and businesses worldwide. We help to redefine lending practices, uncover and prevent fraud, simplify healthcare, create marketing solutions, and gain deeper insights into the automotive market, all using our unique combination of data, analytics, and software. We also assist millions of people in achieving their financial goals and helping them save time and money.\n\nWe operate across multiple markets, from financial services to healthcare, automotive, agribusiness, insurance, and other industry segments.\n\nWe invest in people and new advanced technologies to unlock the power of data. As an FTSE 100 Index company listed on the London Stock Exchange (EXPN), we have a team of 22,500 people across 32 countries. Our corporate headquarters are in Dublin, Ireland. Learn more at experianplc.com.\n\nExperience and Skills\n• 7+ years of software development experience building and testing applications with secure coding practices\n• Hands-on collaboration on a team developing a commercial software project in cloud-native Java\n• You are proficient in developing server-side Java applications using mainstream frameworks such as Spring Boot, Spring Cloud, and Reactor-Core.\n• You have current cloud technology experience AWS (Kubernetes, Fargate, S3, MKS, or Lambda)\n• A current working understanding of microservices, event-driven techniques, and data pipelines\n• You are proficient in SQL and NoSQL-based data access and management\n• Familiarity with async messaging, logging, or queues, such as Kafka, NATS, SQS, and RabbitMQ.\n• Recent experience managing PII/secure/sensitive data\n• You have familiarity with the CI/CD process, testing frameworks, and practices (CodeCommit, CodeDeploy, CodePipeline, CLI)\n• You have experience with the best design and software engineering practices, design principles and patterns, and unit testing.\n• Proficiency in developing easily monitored at the system and business operations level\n\nAdditional Preferred Experience\n• Experience building systems for financial services or tightly regulated businesses.\n• Mass-market retail online consumer product experience\n• Security and privacy compliance (GPDR, CCPA, ISO 27001, PCI, HIPAA) experience\n\nAdditional Information\n\nBenefits/Perks\n• Great compensation package and bonus plan\n• Core benefits including full medical, dental, vision, and matching 401K\n• Flexible schedule, ability to work remotely, hybrid, or in-office\n• Flexible time off, including volunteer time off, vacation, sick, and 12-paid holidays\n\nAdditional Information\n\nOur uniqueness is that we celebrate yours. Experian's culture and people are important differentiators. We take our people's agenda very seriously and focus on what matters: DEI, work/life balance, development, authenticity, engagement, collaboration, wellness, reward & recognition, volunteering... the list goes on. Experian's people-first approach is award-winning: Great Place To Work™ in 24 countries, FORTUNE Best Companies to Work, and Glassdoor Best Places to Work (globally 4.4 Stars), to name a few. Check out Experian Life on social media or our careers site to understand why.\n\nExperian is proud to be an Equal Opportunity and Affirmative Action employer. Innovation is an important part of Experian's DNA and practices, and our diverse workforce drives our success. Everyone can succeed at Experian and bring their whole self to work, regardless of gender, ethnicity, religion, color, sexuality, physical ability, or age. If you have a disability or special need that requires accommodation, please let us know as soon as possible.\n\n#LI-Hybrid",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "7+ years of software development experience building and testing applications with secure coding practices",
          "Hands-on collaboration on a team developing a commercial software project in cloud-native Java",
          "You are proficient in developing server-side Java applications using mainstream frameworks such as Spring Boot, Spring Cloud, and Reactor-Core",
          "You have current cloud technology experience AWS (Kubernetes, Fargate, S3, MKS, or Lambda)",
          "A current working understanding of microservices, event-driven techniques, and data pipelines",
          "You are proficient in SQL and NoSQL-based data access and management",
          "Familiarity with async messaging, logging, or queues, such as Kafka, NATS, SQS, and RabbitMQ",
          "Recent experience managing PII/secure/sensitive data",
          "You have familiarity with the CI/CD process, testing frameworks, and practices (CodeCommit, CodeDeploy, CodePipeline, CLI)",
          "You have experience with the best design and software engineering practices, design principles and patterns, and unit testing",
          "Proficiency in developing easily monitored at the system and business operations level"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "Great compensation package and bonus plan",
          "Core benefits including full medical, dental, vision, and matching 401K",
          "Flexible schedule, ability to work remotely, hybrid, or in-office",
          "Flexible time off, including volunteer time off, vacation, sick, and 12-paid holidays"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Reporting to the Senior Manager of Software Engineering, you will lead projects and developers using the latest technologies and are an important player in designing and implementing product features",
          "This is a technical role requiring excellent coding skills",
          "Hands-on leader with active contributions as a member of software engineering teams focused on building API-based systems, delivering secure, efficient solutions in a bold timeframe",
          "Develop scalable and reliable systems supporting consumer and data-centric products and services on an AWS cloud-based platform",
          "Integrate 3rd Party and Internal API, async, and file-based services using CSV, JSON, or XML data",
          "You will oversee deliverables from brainstorming through testing/validation and production operationalization",
          "Lead, mentor, and collaborate with other team members",
          "Diligently observe and maintain Standards for Regulatory Compliance and Information Security",
          "Without fail, deliver and maintain accurate, complete, and current documentation"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "Experian",
        "link": "https://jobs.experian.com/job/staff-software-engineer-java-in-united-states-jid-1802?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Indeed",
        "link": "https://www.indeed.com/viewjob?jk=6736f5ee01d61ae5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Workday",
        "link": "https://icf.wd5.myworkdayjobs.com/en-US/ICFExternal_Career_Site/job/Software-Engineer---JAVA----Remote-_R2501547?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Smart Recruiters Jobs",
        "link": "https://jobs.smartrecruiters.com/Experian/744000063158791-staff-software-engineer-java?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "LinkedIn",
        "link": "https://www.linkedin.com/jobs/view/software-engineer-java-at-veeva-systems-4221230072?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Startup Jobs",
        "link": "https://startup.jobs/software-engineer-java-veevasystems-6699478?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Teal",
        "link": "https://www.tealhq.com/job/mid-sr-software-engineer-java_8e5bacc0-32f2-45b5-97cf-14851f746159?page=5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "The Muse",
        "link": "https://www.themuse.com/jobs/experian/staff-software-engineer-java?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTdGFmZiBTb2Z0d2FyZSBFbmdpbmVlciAtIEphdmEiLCJjb21wYW55X25hbWUiOiJFeHBlcmlhbiIsImFkZHJlc3NfY2l0eSI6IlVuaXRlZCBTdGF0ZXMiLCJodGlkb2NpZCI6IjdsOE04a3NhRUZWYWROZXZBQUFBQUE9PSIsInV1bGUiOiJ3K0NBSVFJQ0lOVlc1cGRHVmtJRk4wWVhSbGN3In0="
  },
  {
    "title": "Sr. Software Engineer (4234) (Broomfield, CO) Jobs",
    "company_name": "SMX",
    "location": "Broomfield, CO",
    "via": "Security Clearance Jobs",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=OS61fgIwKhx-Go87AAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_1WNsQrCMBQAce3u4vTGVjSRWhfdFBEFcejiVtL4mkbSvJIXsH_jr9qOLnfTccl3llzLIKCkJn5UQDh7Yz1igLTIt0UG6TEQdY1F91rB6ZHBjWqG9SRgVEG3QB4uRMbh4tDG2PNeSmYnDEcVrRaaOkkeaxrke2wnVNyOr96piFW-2wyi92Y5L-9PsB7-hz_DQdbxogAAAA&shmds=v1_AdeF8KhzDb-b2lo423NNvzEE9Q9thmHCkbs-Hc0UqnLQCrOfFw&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=OS61fgIwKhx-Go87AAAAAA%3D%3D",
    "extensions": [
      "20 hours ago",
      "Full-time",
      "Health insurance"
    ],
    "detected_extensions": {
      "posted_at": "20 hours ago",
      "schedule_type": "Full-time",
      "health_insurance": true
    },
    "description": "Outside Analytics has recently become a proud subsidiary of SMX, marking an exciting collaboration that enhances our collective capabilities to deliver cutting-edge digital transformation solutions. Are you interested in the next generation of Space Force Remote Sensing capabilities? At Outside Analytics we're on the ground floor of helping across the future remote sensing ecosystem across all orbital regimes (LEO, MEO, HEO, and GEO)! We build, integrate, and operationally support our customer's emerging space-ground systems to include real-time data processing frameworks, sensor data processing, and data visualization. We are teamed with the most passionate companies in industry, dedicated to bringing best-of-breed capabilities to address our customers most pressing needs.\n\nWe are looking for a Senior Software Engineer who is excited to apply their talents to delivering cutting-edge solutions to our customer's challenging projects. Our applications are primarily built in a Linux environment, primarily using Python, with some C++ and Java. The ideal candidate will contribute as a fulltime, hands-on developer while mentoring a team of software engineers, coordinating tasking and activities to meet program objectives. The ideal candidate is experienced and comfortable providing mentoring, coaching and feedback to individual team members. Additionally, they are excited to contribute to the overall program design and architecture.\n\nPosition is a hybrid role in Broomfield, CO.\n\nEssential Duties & Responsibilities\n• Use Agile methodologies to manage team development tasks and milestones to meet program objectives\n• Ensure that the software development process is efficient and effective.\n• Contribute to the overall program design and architecture.\n• Collaborate with cross-functional teams such as software architects, program managers, designers, and other engineers to design, develop and test software solutions that meet the needs of our customers.\n• Analyze user requirements and develop software specifications.\n• Write clean, efficient, and well-documented code that follows software development best practices.\n• Conduct code reviews and provide feedback to other engineers.\n• Debug and fix issues.\n• Develop and execute test plans to ensure software quality.\n• Deploy software applications to production environments.\n• Maintain and update software applications to ensure they meet user needs and remain secure.\n• Develop and maintain documentation.\n• Stay up to date with industry trends and advancements in technology.\n\nRequired Skills & Experience\n• Clearance Required: Secret This position requires the ability to obtain a DOD Secret Clearance. Interim or Active DOD Secret clearance or higher is preferred. Due to the clearance requirement, U.S. Citizenship is required.\n• Candidate also must agree to participate in a background screen.\n• BS or advanced degree in Computer Science or similar relevant field.\n• 10+ years of experience specifically in a software engineering role (an advanced degree (eg: Masters, PhD) provides two years of experience)\n• Experience mentoring, coaching, and providing feedback to individual team members.\n• Professional, hands-on, development experience with Python, and one of the following languages/tools: Java, JavaScript, C++ 21 or higher\n• Experience with CI/CD and DevOps tools and methodologies.\n\nDesired Skills & Experience\n• Detail oriented and excellent communication skills\n• Automated testing (Playwright)\n• Containerization (eg: Docker, Kubernetes)\n• Database design (eg: Postgres, NoSQL)\n• Messaging middleware (eg: ZeroMQ, NATS)\n• Microservices architecture\n• Atlassian tools\n• Interim or Active DoD SECRET security clearance or higher\n\nApplication Deadline: June 9, 2025\n\n#CJPost\n\n#LI-hybrid\n\nThe SMX salary determination process takes into account a number of factors, including but not limited to, geographic location, Federal Government contract labor categories, relevant prior work experience, specific skills, education and certifications. At SMX, one of our Core Values is to Invest in Our People so we offer a competitive mix of compensation, learning & development opportunities, and benefits. Some key components of our robust benefits include health insurance, paid leave, and retirement.\n\nThe proposed salary for this position is:\n\n$123,800 - $206,300 USD\n\nAt SMX®, we are a team of technical and domain experts dedicated to enabling your mission. From priority national security initiatives for the DoD to highly assured and compliant solutions for healthcare, we understand that digital transformation is key to your future success.\n\nWe share your vision for the future and strive to accelerate your impact on the world. We bring both cutting edge technology and an expansive view of what's possible to every engagement. Our delivery model and unique approaches harness our deep technical and domain knowledge, providing forward-looking insights and practical solutions to power secure mission acceleration.\n\nSMX is an Equal Opportunity employer including disabilities and veterans.\n\nSelected applicant may be subject to a background investigation and/or education verification.",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Clearance Required: Secret This position requires the ability to obtain a DOD Secret Clearance",
          "Due to the clearance requirement, U.S. Citizenship is required",
          "Candidate also must agree to participate in a background screen",
          "BS or advanced degree in Computer Science or similar relevant field",
          "10+ years of experience specifically in a software engineering role (an advanced degree (eg: Masters, PhD) provides two years of experience)",
          "Experience mentoring, coaching, and providing feedback to individual team members",
          "Professional, hands-on, development experience with Python, and one of the following languages/tools: Java, JavaScript, C++ 21 or higher",
          "Experience with CI/CD and DevOps tools and methodologies"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "Some key components of our robust benefits include health insurance, paid leave, and retirement",
          "$123,800 - $206,300 USD"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "The ideal candidate will contribute as a fulltime, hands-on developer while mentoring a team of software engineers, coordinating tasking and activities to meet program objectives",
          "The ideal candidate is experienced and comfortable providing mentoring, coaching and feedback to individual team members",
          "Use Agile methodologies to manage team development tasks and milestones to meet program objectives",
          "Ensure that the software development process is efficient and effective",
          "Contribute to the overall program design and architecture",
          "Collaborate with cross-functional teams such as software architects, program managers, designers, and other engineers to design, develop and test software solutions that meet the needs of our customers",
          "Analyze user requirements and develop software specifications",
          "Write clean, efficient, and well-documented code that follows software development best practices",
          "Conduct code reviews and provide feedback to other engineers",
          "Debug and fix issues",
          "Develop and execute test plans to ensure software quality",
          "Deploy software applications to production environments",
          "Maintain and update software applications to ensure they meet user needs and remain secure",
          "Develop and maintain documentation",
          "Stay up to date with industry trends and advancements in technology"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "Security Clearance Jobs",
        "link": "https://www.clearancejobs.com/jobs/8367160/sr-software-engineer-4234-broomfield-co?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTci4gU29mdHdhcmUgRW5naW5lZXIgKDQyMzQpIChCcm9vbWZpZWxkLCBDTykgSm9icyIsImNvbXBhbnlfbmFtZSI6IlNNWCIsImFkZHJlc3NfY2l0eSI6IkJyb29tZmllbGQsIENPIiwiaHRpZG9jaWQiOiJPUzYxZmdJd0toeC1Hbzg3QUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyJ9"
  },
  {
    "title": "Senior Principal Software Engineer",
    "company_name": "Baxter",
    "location": "United States (+1 other)",
    "via": "Baxter",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=dd6T2ISe8w2KmQPVAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7A4LTzYKJCA7qJojgJBTnksYzvRLvQu7A_oZ_bF3e-Jrvojm0yCQV7pU4UgkZWnnZJ1SECydixAobuEkPiqHGAYThKpIyrk6DWdGj96rZJbVgFF2UtxfGXiY_Sq9_Oh3mruRg2O3228kVTuvlOUw238TwYDJ8QjsHqD-M-vAMlAAAAA&shmds=v1_AdeF8KiyARtZ_oVKorZQt4nF0WHVtY7nZsqbxPJC1tEuK3NzrA&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=dd6T2ISe8w2KmQPVAAAAAA%3D%3D",
    "extensions": [
      "3 days ago",
      "Full-time",
      "Dental insurance",
      "Health insurance",
      "Paid time off"
    ],
    "detected_extensions": {
      "posted_at": "3 days ago",
      "schedule_type": "Full-time",
      "dental_coverage": true,
      "health_insurance": true,
      "paid_time_off": true
    },
    "description": "This is where you save and sustain lives\n\nAt Baxter, we are deeply connected by our mission. No matter your role at Baxter, your work makes a positive impact on people around the world. You’ll feel a sense of purpose throughout the organization, as we know our work improves outcomes for millions of patients.\n\nBaxter’s products and therapies are found in almost every hospital worldwide, in clinics and in the home. For over 85 years, we have pioneered significant medical innovations that transform healthcare.\n\nTogether, we create a place where we are happy, successful and inspire each other. This is where you can do your best work.\n\nJoin us at the intersection of saving and sustaining lives— where your purpose accelerates our mission.\n\nYour Role at Baxter\n\nThis is where your work saves lives\n\nThe research we do and the products we develop improve outcomes for patients around the world. As a Senior Principal Software Engineer at Baxter, your work directly contributes to making a significant impact on others. Its challenging work—and you're not on your own. Our teams collaborate multi-functionally and lead by influence. Whether guiding a team through a project or leading direct reports, our research and development team is responsible for influencing others to achieve results!\nYour Team\n\nAs a Senior Principal Software Engineer, you will be responsible for the research and development of advanced vision care cloud solutions, saving vision for diabetic patients in primary healthcare settings. You will be involved with and have influence over the entire lifecycle including architecture, design, development, and sustaining engineering for new and existing products. The ideal candidate will possess hands-on technical abilities, an understanding of modern software practices, a vision for software development, and a passion for their work in redefining healthcare!\nWhat you'll be doing\n• Support new product development and sustaining development for cloud-based products that integrate with Electronic Medical Record Systems.\n• Work in an Agile Scrum environment, focusing on sustainable development of high performance scalable and maintainable enterprise solutions.\n• Facilitate design discussions regarding architecture and business requirements with Architects, Product Owners, and Business Analysts. Take ownership of undefined and unbounded problems and work with the team to build and deliver scalable designs and solutions.\n• Provide recommendations for continuous improvement and development across products, teams, architecture, and implementations.\n• Ensure successful system delivery to the production environment and assist the operations and support team in resolving production issues.\n• Provide team development and mentorship to individual team members while ensuring use of required technical proficiencies.\n• Participate in the pull request (code reviews) process to ensure alignment to coding standard methodologies.\n• Proven track record of authoring outstanding code, employing known software and enterprise patterns.\nWhat you'll bring\n• B.S. in an engineering, software development, or related subject area with 7+ years of validated experience in a software development role delivering solutions and driving products to production.\n• Experienced in working on large enterprise, high-availability, software products.\n• Proven professional experience with C#, .NET Core, ASP .NET, SQL.\n• Experience integrating with EMR/EHR systems and understanding of healthcare data standards (HL7).\n• Experience with Mirth Connect (NextGen Connect), including developing, deploying, and managing interfaces.\n• Experience with relational or document databases, both are a plus.\n• Experience in microservice architecture, implementation, deployment, and testing (unit, integration, performance).\n• Experience developing software in an agile environment and shipping features in a fast paced, cross-disciplinary team. (Product Owners, Designers, Business Analysts, QA, etc.)\n• Proven experience with test driven development.\n• Experience with CI/CD, Azure pipelines, or concepts and tools in integration/continuous delivery and deployment.\n• Experience with Docker, Docker Compose, Linux container, Kubernetes, and general containerization/orchestration approaches is a plus.\n\nBaxter is committed to supporting the needs for flexibility in the workplace. We do so through our flexible workplace policy which includes a required minimum number of days a week onsite. This policy provides the benefits of connecting and collaborating in-person in support of our Mission. The flexible workplace policy is subject to local laws and legal requirements. At its discretion, Baxter may decide to adjust, suspend, or discontinue as business needs change.\n\nWe understand compensation is an important factor as you consider the next step in your career. At Baxter, we are committed to equitable pay for all employees, and we strive to be more transparent with our pay practices. The estimated base salary for this position is $128,000 to $176,000 annually. The estimated range is meant to reflect an anticipated salary range for the position. We may pay more or less than of the anticipated range based upon market data and other factors, all of which are subject to change. Individual pay is based on upon location, skills and expertise, experience, and other relevant factors. This position may also be eligible for discretionary bonuses. For questions about this, our pay philosophy, and available benefits, please speak to the recruiter if you decide to apply and are selected for an interview.\n\n#LI-ASR2\n\nApplicants must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment visa at this time.\n\nUS Benefits at Baxter (except for Puerto Rico)\n\nThis is where your well-being matters. Baxter offers comprehensive compensation and benefits packages for eligible roles. Our health and well-being benefits include medical and dental coverage that start on day one, as well as insurance coverage for basic life, accident, short-term and long-term disability, and business travel accident insurance. Financial and retirement benefits include the Employee Stock Purchase Plan (ESPP), with the ability to purchase company stock at a discount, and the 401(k) Retirement Savings Plan (RSP), with options for employee contributions and company matching. We also offer Flexible Spending Accounts, educational assistance programs, and time-off benefits such as paid holidays, paid time off ranging from 20 to 35 days based on length of service, family and medical leaves of absence, and paid parental leave. Additional benefits include commuting benefits, the Employee Discount Program, the Employee Assistance Program (EAP), and childcare benefits. Join us and enjoy the competitive compensation and benefits we offer to our employees. For additional information regarding Baxter US Benefits, please speak with your recruiter or visit our Benefits site: Benefits | Baxter\n\nEqual Employment Opportunity\n\nBaxter is an equal opportunity employer. Baxter evaluates qualified applicants without regard to race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, protected veteran status, disability/handicap status or any other legally protected characteristic.\n\nKnow Your Rights: Workplace Discrimination is Illegal\n\nReasonable Accommodations\n\nBaxter is committed to working with and providing reasonable accommodations to individuals with disabilities globally. If, because of a medical condition or disability, you need a reasonable accommodation for any part of the application or interview process, please click on the link here and let us know the nature of your request along with your contact information.\n\nRecruitment Fraud Notice\n\nBaxter has discovered incidents of employment scams, where fraudulent parties pose as Baxter employees, recruiters, or other agents, and engage with online job seekers in an attempt to steal personal and/or financial information. To learn how you can protect yourself, review our Recruitment Fraud Notice.\n\n#LI-Remote",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "B.S. in an engineering, software development, or related subject area with 7+ years of validated experience in a software development role delivering solutions and driving products to production",
          "Experienced in working on large enterprise, high-availability, software products",
          "Proven professional experience with C#, .NET Core, ASP .NET, SQL",
          "Experience integrating with EMR/EHR systems and understanding of healthcare data standards (HL7)",
          "Experience with Mirth Connect (NextGen Connect), including developing, deploying, and managing interfaces",
          "Experience in microservice architecture, implementation, deployment, and testing (unit, integration, performance)",
          "Experience developing software in an agile environment and shipping features in a fast paced, cross-disciplinary team",
          "(Product Owners, Designers, Business Analysts, QA, etc.)",
          "Proven experience with test driven development",
          "Experience with CI/CD, Azure pipelines, or concepts and tools in integration/continuous delivery and deployment",
          "Baxter is committed to supporting the needs for flexibility in the workplace",
          "Applicants must be authorized to work for any employer in the U.S. We are unable to sponsor or take over sponsorship of an employment visa at this time"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "At Baxter, we are committed to equitable pay for all employees, and we strive to be more transparent with our pay practices",
          "The estimated base salary for this position is $128,000 to $176,000 annually",
          "The estimated range is meant to reflect an anticipated salary range for the position",
          "Individual pay is based on upon location, skills and expertise, experience, and other relevant factors",
          "This position may also be eligible for discretionary bonuses",
          "US Benefits at Baxter (except for Puerto Rico)",
          "Baxter offers comprehensive compensation and benefits packages for eligible roles",
          "Our health and well-being benefits include medical and dental coverage that start on day one, as well as insurance coverage for basic life, accident, short-term and long-term disability, and business travel accident insurance",
          "Financial and retirement benefits include the Employee Stock Purchase Plan (ESPP), with the ability to purchase company stock at a discount, and the 401(k) Retirement Savings Plan (RSP), with options for employee contributions and company matching",
          "We also offer Flexible Spending Accounts, educational assistance programs, and time-off benefits such as paid holidays, paid time off ranging from 20 to 35 days based on length of service, family and medical leaves of absence, and paid parental leave",
          "Additional benefits include commuting benefits, the Employee Discount Program, the Employee Assistance Program (EAP), and childcare benefits",
          "Join us and enjoy the competitive compensation and benefits we offer to our employees"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Whether guiding a team through a project or leading direct reports, our research and development team is responsible for influencing others to achieve results!",
          "As a Senior Principal Software Engineer, you will be responsible for the research and development of advanced vision care cloud solutions, saving vision for diabetic patients in primary healthcare settings",
          "You will be involved with and have influence over the entire lifecycle including architecture, design, development, and sustaining engineering for new and existing products",
          "The ideal candidate will possess hands-on technical abilities, an understanding of modern software practices, a vision for software development, and a passion for their work in redefining healthcare!",
          "Support new product development and sustaining development for cloud-based products that integrate with Electronic Medical Record Systems",
          "Work in an Agile Scrum environment, focusing on sustainable development of high performance scalable and maintainable enterprise solutions",
          "Facilitate design discussions regarding architecture and business requirements with Architects, Product Owners, and Business Analysts",
          "Take ownership of undefined and unbounded problems and work with the team to build and deliver scalable designs and solutions",
          "Provide recommendations for continuous improvement and development across products, teams, architecture, and implementations",
          "Ensure successful system delivery to the production environment and assist the operations and support team in resolving production issues",
          "Provide team development and mentorship to individual team members while ensuring use of required technical proficiencies",
          "Participate in the pull request (code reviews) process to ensure alignment to coding standard methodologies",
          "Proven track record of authoring outstanding code, employing known software and enterprise patterns",
          "We do so through our flexible workplace policy which includes a required minimum number of days a week onsite"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "Baxter",
        "link": "https://jobs.baxter.com/en/job/skaneateles-falls/senior-principal-software-engineer/152/82145281008?acm=ALL&alrpm=3996063-4004156-8582140-4005539&ascf=%252525255B%25252525257B%252525252522key%252525252522%252525253A%252525252522ALL%252525252522%252525252C%252525252522value%252525252522%252525253A%252525252522%252525252522%25252525257D%252525255D&lang=en&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Experteer",
        "link": "https://us.experteer.com/career/view-jobs/senior-principal-software-engineer-13152-skaneateles-ny-usa-51930269?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "ZipRecruiter",
        "link": "https://www.ziprecruiter.com/c/100-Welch-Allyn,-Inc.-USA/Job/Senior-Principal-Software-Engineer/-in-Skaneateles,NY?jid=42ec5cd48f23dbec&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Built In",
        "link": "https://builtin.com/job/senior-principal-software-engineer/6372691?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Talentify",
        "link": "https://www.talentify.io/job/senior-principal-software-engineer-skaneateles-new-york-us-baxter-international-jr-150857?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Bandana.com",
        "link": "https://bandana.com/jobs/f880b994-3095-4356-9cfe-48c6092ca180?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTZW5pb3IgUHJpbmNpcGFsIFNvZnR3YXJlIEVuZ2luZWVyIiwiY29tcGFueV9uYW1lIjoiQmF4dGVyIiwiYWRkcmVzc19jaXR5IjoiVW5pdGVkIFN0YXRlcyIsImh0aWRvY2lkIjoiZGQ2VDJJU2U4dzJLbVFQVkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3cifQ=="
  },
  {
    "title": "Software Engineer Lead",
    "company_name": "PNC",
    "location": "Fort Collins, CO",
    "via": "PNC Careers",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=NYaRCGDVrdZP9S9KAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMMQoCMRAAQGzvA4LV1uJdRLDRMqggooIPOJK45iJxN2QXvA_4b7WZcprPpGlv_NC3qwg7iokQK5zQ3aGFI3sQdDUMwAQH5phxth1Ui2yMEcldFHWaQhf4ZZjQ82ie7OVPL8PvLNkp9qv1cuwKxfn0eraQCPZcFSznnEgWYC9fa58CjYgAAAA&shmds=v1_AdeF8KgFmz2ihUmckiVkmgrnaYf2fmH4tODwXTIPEMH-Mz27bQ&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=NYaRCGDVrdZP9S9KAAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/68432db0a7d78447a6fabcd0/images/8232322e9c3cbd9e1cf5502d7df7ad20149290be967fb630d26fb9e58201a3f8.jpeg",
    "extensions": [
      "3 days ago",
      "Full-time",
      "Health insurance",
      "Dental insurance",
      "Paid time off"
    ],
    "detected_extensions": {
      "posted_at": "3 days ago",
      "schedule_type": "Full-time",
      "health_insurance": true,
      "dental_coverage": true,
      "paid_time_off": true
    },
    "description": "Position Overview\n\nAt PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. We work together each day to foster an inclusive workplace culture where all of our employees feel respected, valued and have an opportunity to contribute to the company’s success.\n\nAs a Software Engineer Lead within PNC's Technology – Payments Ecosystem organization, you will be based remotely in Colorado.\n\nAs a Software Engineer Lead you will. you will be responsible for the development, integration, and maintenance of data transformation solutions using IBM Transformation Extender (ITX). You will work closely with cross-functional teams to design and implement solutions that meet business requirements, ensuring efficient and scalable data transformation processes.\n\nResponsibilities of this role include, but are not limited to:\n- Develop and deploy ITX transformation maps and integration flows.\n- Perform data mapping, transformation, and validation in various formats (XML, ISO, EDI, CSV, etc.).\n- Debug, test, and troubleshoot issues in ITX applications.\n- Ensure the efficient handling of large data volumes and high transactions loads.\n- Integrate ITX with various back-end systems.\n\nThis is a remote position. Work may be performed from a quiet, confidential space in a home location, approved by PNC. This position may not be available in all geographic locations.\n\nPNC will not provide sponsorship for employment visas or participate in STEM OPT for this position.\n\nJob Description\n• Creates and leads the technical design and development of software solutions.\n• Proposes & designs software solutions to address complex business needs. Prepares technical and procedural documentation required.\n• Facilitates complex problem resolution.\n• Provides technical guidance and support to colleagues. Reviews coding, testing, and documentation of software.\n• Applies modern principles, methodologies and tools to advance business initiatives and capabilities.\n\nPNC Employees take pride in our reputation and to continue building upon that we expect our employees to be:\n• Customer Focused - Knowledgeable of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions and able to leverage that information in creating customized customer solutions.\n• Managing Risk - Assessing and effectively managing all of the risks associated with their business objectives and activities to ensure they adhere to and support PNC's Enterprise Risk Management Framework.\n\nQualifications\n\nSuccessful candidates must demonstrate appropriate knowledge, skills, and abilities for a role. Listed below are skills, competencies, work experience, education, and required certifications/licensures needed to be successful in this position.\n\nPreferred Skills\nApplication Development, Business Management, Customer Solutions, Design, Group Problem Solving, Process Improvements, Release Management, Software Solutions, User Experience (UX) Design\n\nCompetencies\nApplication Delivery Process, Application Design, Architecture, Application Development Tools, Application Testing, Packaged Application Integration, System Development Life Cycle, Technical Troubleshooting\n\nWork Experience\nRoles at this level typically require a university / college degree, with 3+ years of relevant / direct industry experience. Certifications are often desired. In lieu of a degree, a comparable combination of education, job specific certification(s), and experience (including military service) may be considered.\n\nEducation\nBachelors\n\nCertifications\nNo Required Certification(s)\n\nLicenses\nNo Required License(s)\n\nPay Transparency\n\nBase Salary: $55,000.00 – $158,700.00\n\nSalaries may vary based on geographic location, market data and on individual skills, experience, and education. This role is incentive eligible with the payment based upon company, business and/or individual performance.\n\nApplication Window\n\nGenerally, this opening is expected to be posted for two business days from 06/04/2025, although it may be longer with business discretion.\n\nBenefits\n\nPNC offers a comprehensive range of benefits to help meet your needs now and in the future. Depending on your eligibility, options for full-time employees include: medical/prescription drug coverage (with a Health Savings Account feature), dental and vision options; employee and spouse/child life insurance; short and long-term disability protection; 401(k) with PNC match, pension and stock purchase plans; dependent care reimbursement account; back-up child/elder care; adoption, surrogacy, and doula reimbursement; educational assistance, including select programs fully paid; a robust wellness program with financial incentives.\n\nIn addition, PNC generally provides the following paid time off, depending on your eligibility: maternity and/or parental leave; up to 11 paid holidays each year; 8 occasional absence days each year, unless otherwise required by law; between 15 to 25 vacation days each year, depending on career level; and years of service.\n\nTo learn more about these and other programs, including benefits for full time and part-time employees, visit Your PNC Total Rewards.\n\nDisability Accommodations Statement\n\nIf an accommodation is required to participate in the application process, please contact us via email at AccommodationRequest@pnc.com. Please include “accommodation request” in the subject line title and be sure to include your name, the job ID, and your preferred method of contact in the body of the email. Emails not related to accommodation requests will not receive responses. Applicants may also call 877-968-7762 and say \"Workday\" for accommodation assistance. All information provided will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nAt PNC we foster an inclusive and accessible workplace. We provide reasonable accommodations to employment applicants and qualified individuals with a disability who need an accommodation to perform the essential functions of their positions.\n\nEqual Employment Opportunity (EEO)\n\nPNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law.\n\nThis position is subject to the requirements of Section 19 of the Federal Deposit Insurance Act (FDIA) and, for any registered role, the Secure and Fair Enforcement for Mortgage Licensing Act of 2008 (SAFE Act) and/or the Financial Industry Regulatory Authority (FINRA), which prohibit the hiring of individuals with certain criminal history.\n\nCalifornia Residents\n\nRefer to the California Consumer Privacy Act Privacy Notice to gain understanding of how PNC may use or disclose your personal information in our hiring practices.",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Successful candidates must demonstrate appropriate knowledge, skills, and abilities for a role",
          "Listed below are skills, competencies, work experience, education, and required certifications/licensures needed to be successful in this position",
          "Application Development, Business Management, Customer Solutions, Design, Group Problem Solving, Process Improvements, Release Management, Software Solutions, User Experience (UX) Design",
          "Application Delivery Process, Application Design, Architecture, Application Development Tools, Application Testing, Packaged Application Integration, System Development Life Cycle, Technical Troubleshooting",
          "Roles at this level typically require a university / college degree, with 3+ years of relevant / direct industry experience",
          "In lieu of a degree, a comparable combination of education, job specific certification(s), and experience (including military service) may be considered",
          "Bachelors",
          "No Required Certification(s)",
          "No Required License(s)"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "Pay Transparency",
          "Base Salary: $55,000.00 – $158,700.00",
          "Salaries may vary based on geographic location, market data and on individual skills, experience, and education",
          "This role is incentive eligible with the payment based upon company, business and/or individual performance",
          "PNC offers a comprehensive range of benefits to help meet your needs now and in the future",
          "Depending on your eligibility, options for full-time employees include: medical/prescription drug coverage (with a Health Savings Account feature), dental and vision options; employee and spouse/child life insurance; short and long-term disability protection; 401(k) with PNC match, pension and stock purchase plans; dependent care reimbursement account; back-up child/elder care; adoption, surrogacy, and doula reimbursement; educational assistance, including select programs fully paid; a robust wellness program with financial incentives",
          "In addition, PNC generally provides the following paid time off, depending on your eligibility: maternity and/or parental leave; up to 11 paid holidays each year; 8 occasional absence days each year, unless otherwise required by law; between 15 to 25 vacation days each year, depending on career level; and years of service",
          "To learn more about these and other programs, including benefits for full time and part-time employees, visit Your PNC Total Rewards"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "As a Software Engineer Lead you will",
          "you will be responsible for the development, integration, and maintenance of data transformation solutions using IBM Transformation Extender (ITX)",
          "You will work closely with cross-functional teams to design and implement solutions that meet business requirements, ensuring efficient and scalable data transformation processes",
          "Develop and deploy ITX transformation maps and integration flows",
          "Perform data mapping, transformation, and validation in various formats (XML, ISO, EDI, CSV, etc.)",
          "Debug, test, and troubleshoot issues in ITX applications",
          "Ensure the efficient handling of large data volumes and high transactions loads",
          "Integrate ITX with various back-end systems",
          "Creates and leads the technical design and development of software solutions",
          "Proposes & designs software solutions to address complex business needs",
          "Prepares technical and procedural documentation required",
          "Facilitates complex problem resolution",
          "Provides technical guidance and support to colleagues",
          "Reviews coding, testing, and documentation of software",
          "Applies modern principles, methodologies and tools to advance business initiatives and capabilities",
          "Customer Focused - Knowledgeable of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions and able to leverage that information in creating customized customer solutions",
          "Managing Risk - Assessing and effectively managing all of the risks associated with their business objectives and activities to ensure they adhere to and support PNC's Enterprise Risk Management Framework"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "PNC Careers",
        "link": "https://careers.pnc.com/global/en/job/R190524/Software-Engineer-Lead?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "LinkedIn",
        "link": "https://www.linkedin.com/jobs/view/software-engineer-lead-at-pnc-4245057538?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Experteer",
        "link": "https://us.experteer.com/career/view-jobs/software-engineer-lead-fort-collins-co-usa-51924666?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "PNGAS Job Board",
        "link": "https://pngas.jobboardhq.com/job/eatf93/software-engineer-lead-r190524/fort-collins/co?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "FinancialJobsWeb.com",
        "link": "https://www.financialjobsweb.com/job/software-engineer-lead/78592563/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Talentify",
        "link": "https://www.talentify.io/job/software-engineer-lead-fort-collins-colorado-us-pnc-r190524?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Adzuna",
        "link": "https://www.adzuna.com/details/5234733244?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "WhatJobs",
        "link": "https://www.whatjobs.com/gfj/2000871504?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBMZWFkIiwiY29tcGFueV9uYW1lIjoiUE5DIiwiYWRkcmVzc19jaXR5IjoiRm9ydCBDb2xsaW5zLCBDTyIsImh0aWRvY2lkIjoiTllhUkNHRFZyZFpQOVM5S0FBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3cifQ=="
  },
  {
    "title": "Software Engineer I / Software Engineer II - Backend (Remote - US)",
    "company_name": "BNSF Railway",
    "location": "United States",
    "via": "BNSF Jobs - BNSF Railway",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=lYSGjj0MvFCtWZaWAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_22NsQrCMBQAce0nCMIbVbARwUW3gkodHBo6OJU0fabR9L3SBFq_zN8z7i433HCXfGbJXfIjjGpAOJGxhDhADgL-2Bw2kCn9QmpgWWDHAaMp5SryyjV4VINugQkuzMbh_NiG0PuDEN671PiggtWp5k4wYc2TeHLtf6h8G0-9UwGr3X47pT2Z9SK7yTMUyrpRvcESlGQDNiBjBv0XeRRfxroAAAA&shmds=v1_AdeF8KjnLL2gCDE8mU1AS9o3x5EvnIiejWJh5B1Q4_53QbJoFA&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=lYSGjj0MvFCtWZaWAAAAAA%3D%3D",
    "thumbnail": "https://serpapi.com/searches/68432db0a7d78447a6fabcd0/images/8232322e9c3cbd9e888975ab2cb9a81c588c7a1e6a7d809a3210c2ba570b7187.jpeg",
    "extensions": [
      "6 days ago",
      "Full-time",
      "Health insurance",
      "Paid time off",
      "Dental insurance"
    ],
    "detected_extensions": {
      "posted_at": "6 days ago",
      "schedule_type": "Full-time",
      "health_insurance": true,
      "paid_time_off": true,
      "dental_coverage": true
    },
    "description": "Be part of a team that values safety, inclusion, and excellence\n\nWe are one of the largest U.S. railroads transporting the nation’s freight across 28 western states and 3 Canadian provinces. As a member of our team, you will play a role in supporting the movement of essential products and materials that help feed, clothe, supply, and power communities throughout America and the world.\n\nThe US base salary range for this full-time position is $93,750-$206,250 plus bonus eligibility and other elements of our total rewards package.  The range represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role.  Individual compensation is determined by the hiring location and additional factors including but not limited to job-related skills, experience, and relevant education or training. In addition to base pay, BNSF offers a comprehensive benefits package.\n\nWe are committed to a culture where all employees are included, belong, and have equal opportunity to achieve their full potential. Come make a difference with us!\n\nLearn more about BNSF and our Benefits\n\nJob Location: REMOTE\nOther Potential Locations: Remote US\nAnticipated Start Date: 06/16/2025\nNumber of Positions: 20\nSalary Range: $93,750-$206,250\n\nThe US base salary range for this full-time position is $93,750-$206,250 plus bonus eligibility and other elements of our total rewards package. The range represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role. Individual compensation is determined by the hiring location and additional factors including but not limited to job-related skills, experience, and relevant education or training. In addition to base pay, BNSF offers a comprehensive benefits package.\n\nApply early as this job may be removed or filled prior to the closing date, which is approximately seven (7) days after the posting date.\n\nWe are committed to a culture where all employees are included, belong, and have equal opportunity to achieve their full potential. Come make a difference with us!\n\nThe bnsf | tech department drives innovation and efficiency by developing and maintaining advanced technological solutions across the network. This team ensures a robust IT infrastructure, supports critical applications, and enhances cybersecurity measures. Their expertise is essential in optimizing operations and enabling BNSF to deliver reliable, cutting-edge transportation services.\n\nThis is a full-time position. Our leaders also foster a culture where work life balance, which requires flexibility for when life happens, is important and respected.\n\nAs a Software Engineer, you will\n• Design, develop, and maintain backend services and APIs\n• Design, develop, and maintain docker modules for deployment on Nvidia Jetson-based edge devices.\n• Develop sensor interfacing software in Python and C++ to capture and process data from cameras, lidars, and similar devices.\n• Write clean, efficient, and well-documented code\n• Collaborate with frontend developers to integrate user-facing elements with server-side logic\n• Collaborate with data scientists to integrate computer vision models and support autonomous operational tasks.\n• Identify and troubleshoot performance and scalability issues\n• Implement security best practices to protect sensitive data\n• Work closely with product managers to understand requirements and deliver solutions\n• Stay up-to-date with emerging technologies and industry trends\n• Engage in cross-functional collaboration throughout the entire software lifecycle to solve complex problems\n• Participate in design sessions and code reviews with peers to elevate the quality of engineering across the organization\n• Be accountable for the quality, usability, and performance of solutions\n• Consistently share best practices and improve processes within and across teams\n\nBasic Qualifications\n• I am CURRENTLY authorized to work in the US.\n• Bachelor's degree in Computer Science, Software Engineering, Embedded Systems, or a related field or equivalent education or work experience.\n• Experience in software engineering with demonstrated success delivering enterprise-scale solutions.\n• Fluency and Specialization with technologies such as Python, C++, .NET, Java, Springboot, Relational and NoSQL Databases, and Containers.\n• Experience with continuous delivery and infrastructure as code.\n• Experience with application monitoring tools and performance assessments, particularly for systems in mobile or intermittently connected environments..\n• Ability to excel in a fast-paced, startup-like environment.\n• Knowledge of developer tooling across the software development life cycle (task management, source code, building, deployment, operations, real-time communication).\n• Experience in testing methodologies using frameworks such as BDD, etc.\n\nPreferred Qualifications\n• If offered a position by BNSF, I will NOT IN THE FUTURE require BNSF’s assistance (whether monetary, through sponsorship, through preparation of a training plan, or otherwise) to obtain employment-based nonimmigrant status, such as H-1B or TN, or other authorization to work at BNSF, such as through STEM OPT.\n• Experience in Rail, Shipping, Airline, Logistics, Warehousing, Supply Chain, or other Transportation industries.\n• Experience with Nvidia Jetson platforms.\n• Exposure to computer vision, robotics, or autonomous system development.\n• Familiarity with sensor technologies (e.g., cameras, LiDAR, radar) and data processing techniques.\n• Familiarity with Microservices development.\n• Experience with open-source libraries and frameworks.\n• Familiarity with Message Brokers such as RabbitMQ and Kafka.\n• Experience working in an Agile environment (Scrum, Kanban, SAFe).\n• Proven ability to debug, analyze, and resolve performance bottlenecks in complex applications.\n\nAt BNSF, you will have access to a comprehensive and competitive benefits package including:\n• An industry-leading 401(k) and renowned Railroad Retirement program.\n• A range of robust health care options for you and your dependents (including domestic partners), including medical, dental, vision, telemedicine, mental health, cancer support, and high-quality care network options.\n• Health care spending accounts (HSA) with employer contributions, as well as life and disability insurance, provided at no cost.\n• Family benefits including parental, pediatric and family building support, adoption and surrogacy reimbursement, and dependent care spending account (with employer match).\n• Access to discounts on travel, gym memberships, counseling services and wellness support.\n• Annual bonus (Incentive Compensation Program)\n• Generous leave / time off policies.\n• For more information, visit Benefits.\n\nPlease be aware of potential fraud that can occur when searching for new career opportunities. Please review our FAQ for more information and awareness.\n\nAll positions require pre-employment background verification, medical review and pre-employment drug screen. You can find more information by reviewing the Hiring Process. Federal authority requires BNSF employees, whose work requires unescorted access to secure areas of port facilities, to obtain a TWIC. More information is available at https://www.tsa.gov/for-industry/twic\n\nBNSF Railway is an Equal Opportunity Employer, all qualified applicants receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status.\n\nSF: MO | [[mfield5]] | bnsf tech | REMOTE, US | 00000",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "I am CURRENTLY authorized to work in the US",
          "Bachelor's degree in Computer Science, Software Engineering, Embedded Systems, or a related field or equivalent education or work experience",
          "Experience in software engineering with demonstrated success delivering enterprise-scale solutions",
          "Fluency and Specialization with technologies such as Python, C++, .NET, Java, Springboot, Relational and NoSQL Databases, and Containers",
          "Experience with continuous delivery and infrastructure as code",
          "Experience with application monitoring tools and performance assessments, particularly for systems in mobile or intermittently connected environments.",
          "Ability to excel in a fast-paced, startup-like environment",
          "Knowledge of developer tooling across the software development life cycle (task management, source code, building, deployment, operations, real-time communication)",
          "Experience in testing methodologies using frameworks such as BDD, etc",
          "Federal authority requires BNSF employees, whose work requires unescorted access to secure areas of port facilities, to obtain a TWIC"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "The US base salary range for this full-time position is $93,750-$206,250 plus bonus eligibility and other elements of our total rewards package.  The range represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role.  Individual compensation is determined by the hiring location and additional factors including but not limited to job-related skills, experience, and relevant education or training. In addition to base pay, BNSF offers a comprehensive benefits package",
          "Salary Range: $93,750-$206,250",
          "The US base salary range for this full-time position is $93,750-$206,250 plus bonus eligibility and other elements of our total rewards package",
          "The range represents the amount bnsf | tech reasonably expects to pay for the position based on the level, scope, and responsibilities of the role",
          "Individual compensation is determined by the hiring location and additional factors including but not limited to job-related skills, experience, and relevant education or training",
          "In addition to base pay, BNSF offers a comprehensive benefits package",
          "At BNSF, you will have access to a comprehensive and competitive benefits package including:",
          "An industry-leading 401(k) and renowned Railroad Retirement program",
          "A range of robust health care options for you and your dependents (including domestic partners), including medical, dental, vision, telemedicine, mental health, cancer support, and high-quality care network options",
          "Health care spending accounts (HSA) with employer contributions, as well as life and disability insurance, provided at no cost",
          "Family benefits including parental, pediatric and family building support, adoption and surrogacy reimbursement, and dependent care spending account (with employer match)",
          "Access to discounts on travel, gym memberships, counseling services and wellness support",
          "Annual bonus (Incentive Compensation Program)",
          "Generous leave / time off policies",
          "For more information, visit Benefits"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Their expertise is essential in optimizing operations and enabling BNSF to deliver reliable, cutting-edge transportation services",
          "Design, develop, and maintain backend services and APIs",
          "Design, develop, and maintain docker modules for deployment on Nvidia Jetson-based edge devices",
          "Develop sensor interfacing software in Python and C++ to capture and process data from cameras, lidars, and similar devices",
          "Write clean, efficient, and well-documented code",
          "Collaborate with frontend developers to integrate user-facing elements with server-side logic",
          "Collaborate with data scientists to integrate computer vision models and support autonomous operational tasks",
          "Identify and troubleshoot performance and scalability issues",
          "Implement security best practices to protect sensitive data",
          "Work closely with product managers to understand requirements and deliver solutions",
          "Stay up-to-date with emerging technologies and industry trends",
          "Engage in cross-functional collaboration throughout the entire software lifecycle to solve complex problems",
          "Participate in design sessions and code reviews with peers to elevate the quality of engineering across the organization",
          "Be accountable for the quality, usability, and performance of solutions",
          "Consistently share best practices and improve processes within and across teams"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "BNSF Jobs - BNSF Railway",
        "link": "https://jobs.bnsf.com/us/en/job/93708/Software-Engineer-I-Software-Engineer-II-Backend-Remote-US?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Indeed",
        "link": "https://www.indeed.com/viewjob?jk=afa2bcee57e18147&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Glassdoor",
        "link": "https://www.glassdoor.com/job-listing/software-engineer-i-software-engineer-ii-backend-remote-us-bnsf-railway-JV_KO0,58_KE59,71.htm?jl=1009743207878&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Energy Jobline",
        "link": "https://www.energyjobline.com/job/engineer-i-ii-senior-sr-ii-gas-25764047?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Careers In San Antonio, TX - Greater:SATX",
        "link": "https://careers.greatersatx.com/companies/bnsf-railway/jobs/51093522-software-engineer-i-software-engineer-ii-backend-remote-us?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Jobgether",
        "link": "https://jobgether.com/offer/683acc7c73da501d6d720a0f-career-opportunities-software-engineer-i-software-engineer-ii---backend-remote---us-93708?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciBJIC8gU29mdHdhcmUgRW5naW5lZXIgSUkgLSBCYWNrZW5kIChSZW1vdGUgLSBVUykiLCJjb21wYW55X25hbWUiOiJCTlNGIFJhaWx3YXkiLCJhZGRyZXNzX2NpdHkiOiJVbml0ZWQgU3RhdGVzIiwiaHRpZG9jaWQiOiJsWVNHamowTXZGQ3RXWmFXQUFBQUFBPT0iLCJ1dWxlIjoidytDQUlRSUNJTlZXNXBkR1ZrSUZOMFlYUmxjdyJ9"
  },
  {
    "title": "Software Engineer (Frontend) - Early in Career - 32170",
    "company_name": "Splunk",
    "location": "Colorado (+1 other)",
    "via": "Splunk",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=SznGRzZL6miUGTPNAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_x2NsQrCQBBEsU1pabWlCsnFiAhaShQEq3xAuCTrJXruHrcnxr_xUz1tZoo3vEk-k-RS8TW8tEcoyQyE6GF-9EwBqVtACqX29g0DwSFuIkxhXay2eewzNyCofdsDE5yYjcXZvg_ByU4pEZsZCToMbdbyQzFhw6O6cSO_qKWPPmd1wLrY5GPmyCynlbNPuv_f2LLXHX8BxsmDQ6MAAAA&shmds=v1_AdeF8KhhAM6qqJF1QSp_IcdWW2eH9vQEV4m5FekO1yxiA2cxZg&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=SznGRzZL6miUGTPNAAAAAA%3D%3D",
    "extensions": [
      "1 month ago",
      "Full-time",
      "Dental insurance",
      "Health insurance",
      "Paid time off"
    ],
    "detected_extensions": {
      "posted_at": "1 month ago",
      "schedule_type": "Full-time",
      "dental_coverage": true,
      "health_insurance": true,
      "paid_time_off": true
    },
    "description": "Splunk, a Cisco company, is building a safer and more resilient digital world with an end-to-end full stack platform made for a hybrid, multi-cloud world. Leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. Our customers love our technology, but it's our caring employees that make Splunk stand out as an amazing career destination. No matter where in the world or what level of the organization, we approach our work with kindness. So bring your work experience, problem-solving skills and talent, of course, but also bring your joy, your passion and all the things that make you, you. Come help organizations be their best, while you reach new heights with a team that has your back. Role Summary:Splunk is looking for new grads or early in career talent to join our team. As a Front-end Software Engineer, you will work on real projects that go to market. You will also have an opportunity to enjoy our dynamic, startup-like environment. You will get invaluable work experience at a leader in “Big Data”, the hottest software market now.You will experience Splunking and what defines our culture while honing the skills which separate our development teams from others. Working to support internal and external customer needs, you will collaborate with cross-functional teams, receive mentorship, and gain insight into our values-driven process. Our goal is both to support your growth and development while empowering you for a successful start to your career.What you'll get to do:You will get to work with smart and hardworking individuals who are doing state of the art development work (native mobile, front-end and back-end, DevOps) in areas of machine learning, data analytics, infrastructure and event correlations across silos to build best-in-class business analytics software. You will be interacting with product management and customers to understand detailed requirements. You will also work with other engineering teams across Splunk to design and build high-performance solutions.\n• Design, develop, code and test software systems, or applications for software improvements and new products.\n• Build innovative solutions that enable rapid development.\n• Contribute through participation in agile development of project timelines, implementation design specifications, system flow diagrams, documentation, testing, and ongoing support of systems.\n• Make an impact through your recommended modifications to processes and procedures, and directly contribute to standard methodologies, architecture, and implementation.\nMust-have Qualifications:\n• A Bachelor's or Master's in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievement.\nNice-to-have Qualifications:We’ve taken special care to separate the must-have qualifications from the nice-to-haves. “Nice-to-have” means just that: Nice. To. Have. So, don’t worry if you can’t check off every box. We’re not hiring a list of bullet points–we’re interested in the whole you.\n• Strong interest in front-end/UI development\n• Familiarity with frontend JavaScript technologies including React/Redux, (nice to have: Typescript, jQuery, Backbone)\n• Exposure to styling web applications using CSS\n• Experience with modern version control system, such as Git and etc\n• Exposure to test automation, such as Karma, Mocha, Jest, Storybook, etc\n• Understanding of CI/CD\n• Experience building meaningful software applications: in a class, as a personal hobby, as a job, as part of an open source project\n• Exposure to Agile development\n• Experience collaborating with others in a fast-paced environment\n• Strong communication skills, verbal and written\n• Minimum 6 months relevant work or internship experience\nSplunk is an Equal Opportunity EmployerSplunk, a Cisco company, is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis.\n\nNote:\n\nBase Pay Range\n\nSF Bay Area, Seattle Metro, and New York City Metro Area\n\nBase Pay Range: $119,200.00 - 163,900.00 per year\n\nCalifornia (excludes SF Bay Area), Washington (excludes Seattle Metro), Washington DC Metro, and Massachusetts\n\nBase Pay Range: $107,280.00 - 147,510.00 per year\n\nAll other cities and states excluding California, Washington, Massachusetts, New York City Metro Area and Washington DC Metro Area.\n\nBase Pay Range: $95,360.00 - 131,120.00 per year\n\nSplunk provides flexibility and choice in the working arrangement for most roles, including remote and/or in-office roles. We have a market-based pay structure which varies by location. Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills and experience of the candidate. In addition to base pay, this role is eligible for incentive compensation and may be eligible for equity or long-term cash awards.\n\nBenefits are an important part of Splunk's Total Rewards package. This role is eligible for a competitive benefits package which includes medical, dental, vision, a 401(k) plan and match, paid time off and much more! Learn more about our next-level benefits at https://splunkbenefits.com.",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "A Bachelor's or Master's in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievement",
          "Nice-to-have Qualifications:We’ve taken special care to separate the must-have qualifications from the nice-to-haves",
          "Strong interest in front-end/UI development",
          "Familiarity with frontend JavaScript technologies including React/Redux, (nice to have: Typescript, jQuery, Backbone)",
          "Exposure to styling web applications using CSS",
          "Experience with modern version control system, such as Git and etc",
          "Exposure to test automation, such as Karma, Mocha, Jest, Storybook, etc",
          "Experience building meaningful software applications: in a class, as a personal hobby, as a job, as part of an open source project",
          "Exposure to Agile development",
          "Experience collaborating with others in a fast-paced environment",
          "Strong communication skills, verbal and written",
          "Minimum 6 months relevant work or internship experience"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "SF Bay Area, Seattle Metro, and New York City Metro Area",
          "Base Pay Range: $119,200.00 - 163,900.00 per year",
          "Base Pay Range: $107,280.00 - 147,510.00 per year",
          "All other cities and states excluding California, Washington, Massachusetts, New York City Metro Area and Washington DC Metro Area",
          "Base Pay Range: $95,360.00 - 131,120.00 per year",
          "Splunk provides flexibility and choice in the working arrangement for most roles, including remote and/or in-office roles",
          "We have a market-based pay structure which varies by location",
          "Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills and experience of the candidate",
          "In addition to base pay, this role is eligible for incentive compensation and may be eligible for equity or long-term cash awards",
          "Benefits are an important part of Splunk's Total Rewards package",
          "This role is eligible for a competitive benefits package which includes medical, dental, vision, a 401(k) plan and match, paid time off and much more!"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "As a Front-end Software Engineer, you will work on real projects that go to market",
          "Working to support internal and external customer needs, you will collaborate with cross-functional teams, receive mentorship, and gain insight into our values-driven process",
          "What you'll get to do:You will get to work with smart and hardworking individuals who are doing state of the art development work (native mobile, front-end and back-end, DevOps) in areas of machine learning, data analytics, infrastructure and event correlations across silos to build best-in-class business analytics software",
          "You will be interacting with product management and customers to understand detailed requirements",
          "You will also work with other engineering teams across Splunk to design and build high-performance solutions",
          "Design, develop, code and test software systems, or applications for software improvements and new products",
          "Build innovative solutions that enable rapid development",
          "Contribute through participation in agile development of project timelines, implementation design specifications, system flow diagrams, documentation, testing, and ongoing support of systems",
          "Make an impact through your recommended modifications to processes and procedures, and directly contribute to standard methodologies, architecture, and implementation"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "Splunk",
        "link": "https://www.splunk.com/en_us/careers/jobs/software-engineer-frontend-early-32170.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Resume Copilot",
        "link": "https://jobs.resumecopilot.net/job/tQzYr5YB_CyF9o_05jYe0525?i=0334137a3cb44f9ca5260194a16b29a3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciAoRnJvbnRlbmQpIC0gRWFybHkgaW4gQ2FyZWVyIC0gMzIxNzAiLCJjb21wYW55X25hbWUiOiJTcGx1bmsiLCJhZGRyZXNzX2NpdHkiOiJDb2xvcmFkbyIsImh0aWRvY2lkIjoiU3puR1J6Wkw2bWlVR1RQTkFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3cifQ=="
  },
  {
    "title": "Software Engineer",
    "company_name": "Centennial Lending, LLC",
    "location": "Firestone, CO",
    "via": "Indeed",
    "share_link": "https://www.google.com/search?ibp=htl;jobs&q=sofware+engineer&htidocid=h9_W-dUs_ca7O6EaAAAAAA%3D%3D&hl=en-US&shndl=37&shmd=H4sIAAAAAAAA_xXMsQrCMBAAUFz7CU43FqmNCC46BhWk4OAHlCSeaUq8K7kD-xv-sXV546u-q6p-8Es_riCcKSZCLLCFG3sQdCUMwARX5phxfRpUJzkaI5LbKOo0hTbw2zCh59mM7OVPL8PSTdkp9vvDbm4nipvaIikSJZehQ3omig10nYVEcEkFRZelAXv_Ad6J4peUAAAA&shmds=v1_AdeF8KhbNohCO-eozP2odsnLFz0JWsMjVfTbWfga39904e4abQ&source=sh/x/job/li/m1/1#fpstate=tldetail&htivrt=jobs&htiq=sofware+engineer&htidocid=h9_W-dUs_ca7O6EaAAAAAA%3D%3D",
    "extensions": [
      "3 days ago",
      "80K–120K a year",
      "Full-time",
      "Paid time off",
      "Dental insurance",
      "Health insurance"
    ],
    "detected_extensions": {
      "posted_at": "3 days ago",
      "salary": "80K–120K a year",
      "schedule_type": "Full-time",
      "paid_time_off": true,
      "dental_coverage": true,
      "health_insurance": true
    },
    "description": "NOTE: THIS IS A HYBRID IN-OFFICE / WFH ROLE WHERE YOU MUST BE LOCATED TO COMFORTABLY COME INTO OUR OFFICE IN FIRESTONE, CO.\n\nCompany Description\n\nCentennial Lending is a unique and growing lending company located in Firestone, CO offering a wide variety of products including conventional, FHA, VA, and USDA mortgages, commercial loan products, and service offerings. Through our partnerships with credit unions and other investors we are able to offer a wide variety of loan products to credit union members.\n\nCentennial Lending offers its employees opportunities for advancement within the company as well as an extremely competitive and comprehensive benefits package that includes Medical, Dental, Vision, 401K, and potential for annual bonus.\n\nJob Description\n\nCentennial Lending is a growing organization and is recruiting for a highly skilled Software Engineer to contribute to our IT projects and help us build scalable, efficient applications, microservices, and ETL pipelines. The majority of training and daily work will be performed onsite at our Firestone, CO location.\n\nJob Duties\n• Design, develop, and maintain a diverse set of microservices, monolithic applications, and APIs using JavaScript.\n• Create and maintain automations, ETL pipelines, and business intelligence scripts using Python and SQL.\n• Host applications and services within the Microsoft Azure ecosystem, including Web Apps, Function Apps, and Logic Apps.\n• Assist with the consolidation of our diverse use of languages and frameworks\n• Develop and manage ETL pipelines in Azure, facilitating the movement and aggregation of data across various operational platforms.\n• Create Python scripts to automate the flow of data between partners.\n• Write custom plugins within the organization’s operational systems to perform custom tasks and improve manual processes\n• Collaborate with cross-functional teams to define, design, and implement process improvements via custom software solutions.\n• Ensure the performance, quality, and responsiveness of applications.\n• Identify and correct bottlenecks and fix bugs.\n• Maintain code quality, organization, and automation.\n• Other duties as assigned.\n\nQualification and Education Requirements\n• Relevant certifications, such as Microsoft Certified: Azure Developer Associate, or other industry-recognized qualifications, are highly preferred.\n• Ongoing commitment to professional development and continuous learning.\n• Five to ten years of relevant experience required.\n• Bachelor’s degree in computer science, information technology, or a related field preferred but not required.\n\nPreferred Skills\n• Proven experience as a mid- to senior-level software engineer, with experience hosting systems in Microsoft Azure.\n• Strong proficiency in JavaScript or TypeScript APIs or serverless functions\n• Proficiency in Python, specifically for ETL pipelines, business intelligence, and/or automation scripting\n• Must have experience working with Azure, including the development of microservices and ETL pipelines.\n• Familiarity with RESTful APIs to connect applications to back-end services.\n• Strong understanding of Microsoft cloud technologies (Azure Web Apps, Azure Logic Apps).\n• Ability to write clean, readable, and easily maintainable code.\n• Strong problem-solving skills and attention to detail.\n• Ability to work autonomously, understanding business requirements and translating them into technical or software solutions.\n• Must be self-motivated and work independently to manage workflow and deadlines.\n• Excellent communication and teamwork skills.\n• Willingness to learn new languages and system.\n\nCompany website: www.centennial-lending.com\n\nOur new HQ: www.centennial-lending.com/new-hq\n\nJob Type: Full-time\n\nPay: $80,000.00 - $120,000.00 per year\n\nBenefits:\n• 401(k)\n• 401(k) matching\n• Dental insurance\n• Employee assistance program\n• Flexible schedule\n• Health insurance\n• Health savings account\n• Life insurance\n• Paid time off\n• Vision insurance\n\nSchedule:\n• 8 hour shift\n• Monday to Friday\n\nLocation:\n• Firestone, CO 80504 (Required)\n\nAbility to Commute:\n• Firestone, CO 80504 (Required)\n\nWork Location: Hybrid remote in Firestone, CO 80504",
    "job_highlights": [
      {
        "title": "Qualifications",
        "items": [
          "Ongoing commitment to professional development and continuous learning",
          "Five to ten years of relevant experience required",
          "Firestone, CO 80504 (Required)"
        ]
      },
      {
        "title": "Benefits",
        "items": [
          "Centennial Lending offers its employees opportunities for advancement within the company as well as an extremely competitive and comprehensive benefits package that includes Medical, Dental, Vision, 401K, and potential for annual bonus",
          "Pay: $80,000.00 - $120,000.00 per year",
          "401(k)",
          "401(k) matching",
          "Dental insurance",
          "Employee assistance program",
          "Flexible schedule",
          "Health insurance",
          "Health savings account",
          "Life insurance",
          "Paid time off",
          "Vision insurance",
          "8 hour shift",
          "Monday to Friday"
        ]
      },
      {
        "title": "Responsibilities",
        "items": [
          "Design, develop, and maintain a diverse set of microservices, monolithic applications, and APIs using JavaScript",
          "Create and maintain automations, ETL pipelines, and business intelligence scripts using Python and SQL",
          "Host applications and services within the Microsoft Azure ecosystem, including Web Apps, Function Apps, and Logic Apps",
          "Assist with the consolidation of our diverse use of languages and frameworks",
          "Develop and manage ETL pipelines in Azure, facilitating the movement and aggregation of data across various operational platforms",
          "Create Python scripts to automate the flow of data between partners",
          "Write custom plugins within the organization’s operational systems to perform custom tasks and improve manual processes",
          "Collaborate with cross-functional teams to define, design, and implement process improvements via custom software solutions",
          "Ensure the performance, quality, and responsiveness of applications",
          "Identify and correct bottlenecks and fix bugs",
          "Maintain code quality, organization, and automation",
          "Other duties as assigned"
        ]
      }
    ],
    "apply_options": [
      {
        "title": "Indeed",
        "link": "https://www.indeed.com/viewjob?jk=d4958fd72b682449&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      },
      {
        "title": "Glassdoor",
        "link": "https://www.glassdoor.com/job-listing/software-engineer-centennial-lending-llc-JV_IC1148270_KO0,17_KE18,40.htm?jl=1009766657678&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
      }
    ],
    "job_id": "eyJqb2JfdGl0bGUiOiJTb2Z0d2FyZSBFbmdpbmVlciIsImNvbXBhbnlfbmFtZSI6IkNlbnRlbm5pYWwgTGVuZGluZywgTExDIiwiYWRkcmVzc19jaXR5IjoiRmlyZXN0b25lLCBDTyIsImh0aWRvY2lkIjoiaDlfVy1kVXNfY2E3TzZFYUFBQUFBQT09IiwidXVsZSI6IncrQ0FJUUlDSU5WVzVwZEdWa0lGTjBZWFJsY3cifQ=="
  }
]